// Задача 23: Напишите программу, которая принимает на
// вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
// 3 -> 1, 4, 9.
// 5 -> 1, 8, 27, 64, 125
// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125

Console.Write("введите целое положительное число: ");
int a = int.Parse(Console.ReadLine());
if (a <= 0)
{
    Console.WriteLine("неверное число");
}
else
    Console.WriteLine("|{0,5}|{1,5}|", "Число", "Куб");
{
    for (int i = 1; i <= a; i++)
    {
        int answer = i * i * i;
        Console.WriteLine("|{0,5}|{1,5}|", a, answer);
    }
}